{
  "backend/main.mo": "Main Motoko actor defining data types and backend logic for an insurance inquiry platform, including user profiles, insurance plans, inquiries, agents, and contact messages with role-based access control.",
  "feature_evidence.json": "Feature evidence report mapping four insurance platform features (inquiry form, plans page, contact agent, admin dashboard) to their implementing frontend files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries for each frontend source file, describing their purpose and notable type-conflict fixes between backend Agent and @dfinity/agent types.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the React app, mounting the app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Home, Plans, Contact, and Admin pages, and conditionally renders a ProfileSetupModal for newly authenticated users.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that blocks access to admin content by showing login or access-denied screens based on authentication and admin status checks.",
  "frontend/src/components/AgentCard.tsx": "Card component displaying an agent's avatar, name, insurance specializations, phone, and email, with an optional contact button that triggers a callback.",
  "frontend/src/components/ContactMessageForm.tsx": "A form component that allows authenticated users to select an agent, enter a subject and message, and send it via the `useSendMessageToAgent` hook, with login prompt for unauthenticated users and a success confirmation state.",
  "frontend/src/components/ContactMessagesTable.tsx": "Displays a paginated table of contact messages with sender, agent name, date, and message preview columns, including loading skeletons and an empty state.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick navigation links, coverage type list, copyright, and a caffeine.ai attribution link.",
  "frontend/src/components/InquiryDetailsModal.tsx": "A dialog modal that shows full details of an insurance inquiry and allows admins to update its status via the `useUpdateInquiryStatus` hook.",
  "frontend/src/components/InquiryTable.tsx": "A filterable table of insurance inquiries supporting type and status filters, with loading skeletons and a view-details action per row.",
  "frontend/src/components/InsuranceInquiryForm.tsx": "A multi-step insurance inquiry form that renders type-specific fields based on the selected insurance type and submits the inquiry via `useSubmitInsuranceInquiry`, with login gating and a success state.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a NavigationBar, a main content outlet, and a Footer.",
  "frontend/src/components/NavigationBar.tsx": "Sticky navigation bar component with logo, desktop/mobile nav links, and Internet Identity login/logout button; conditionally shows an Admin link for admin users.",
  "frontend/src/components/PlanCard.tsx": "Card component that displays an insurance plan's type, coverage amount, features, and monthly premium, with a 'Get Quote' button that navigates to the home page with pre-filled search params.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to enter their name and email to create a profile, using the useSaveCallerUserProfile mutation on submit.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) via React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, exposing identity, login/clear functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions, including user profile, insurance plans, inquiries, agents, and contact messages CRUD operations.",
  "frontend/src/index.css": "Global CSS file that imports Inter and Merriweather fonts, sets up Tailwind directives, and defines light/dark mode CSS custom properties for the design system including teal brand colors, typography, and utility classes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page protected by AdminGuard that displays stats cards for inquiry counts and tabbed views for managing insurance inquiries and contact messages, with a details modal for individual inquiries.",
  "frontend/src/pages/ContactPage.tsx": "Contact page that lists agents via AgentCard components with a pre-selectable contact form, plus office info with address, phone, and email details.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero banner with a gradient overlay, trust stats bar, and a two-column layout with a step-by-step guide alongside the InsuranceInquiryForm, supporting URL query params to pre-select insurance type and plan.",
  "frontend/src/pages/PlansPage.tsx": "Plans page that fetches and displays insurance plans in a responsive grid, filterable by type (health, auto, life, home) via tabs, with skeleton loading states and empty state handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color palette (oklch-based tokens including teal, gold, success, warning, sidebar), typography, border radius, box shadows, and keyframe animations for the frontend.",
  "project_state.json": "Project state manifest describing an insurance inquiry website with features for multi-type quote forms, plan browsing, agent contact, and an admin dashboard, along with versioning metadata and image requirements."
}